[
  {
    "title": "CRWV: AI Rocket or Debt Bomb? Thoughts?",
    "text": "Alright, looked into **CoreWeave (CRWV)**. It's an \"AI Hyperscaler\".. gives GPU (Nvidia) for AI stuff. Stock went nuts since IPO (like 300% up)  \n\n**Quick Take:** CRWV: Big AI growth, Nvidia likes them. BUT huge debt, only 2 big clients (MSFT, OpenAI), and weird deals with Nvidia & Applied Digital where they invest in each other.\n\n**The Good:**\n\n* **AI Demand:** Selling GPU power for AI. Revenue shot up: $229M (2023) to maybe $8B (2025 est).Q1 2025 rev $981.6M, +420% YoY. \n* **Nvidia Favored?** Gets Nvidia's new GPUs (GB200s) early. Nvidia invested, owns \\~7%. \n* **Huge Contracts:** $10B Microsoft deal (MSFT is 72% of Q1 rev!).\\~$16B from OpenAI. \n* **Stock Surge:** Stock jumped big after IPO from AI hype & news. \n\n**The Bad:**\n\n* **Massive Debt:** Over $12.7B raised (equity/debt) by end 2024, liabilities >$18.8B Q1 2025. Interest could be $2B+/year.S-1 said \"material weaknesses in internal control\". Not great.  \n* **No Profit:** Big revenue, still big losses. Net loss $863M (2024), $314.6M (Q1 2025). \n* **Few Customers:** MSFT is 72% of revenue. OpenAI other main one. Risky.  \n* **Nvidia Reliance:** All GPUs from Nvidia. If Nvidia has issues, CRWV does too.  \n\n**The Weird Loops:**\n\n* **Nvidia:**\n   * Nvidia investor (\\~7% stake). \n   * CRWV buys all GPUs from Nvidia. So NVDA invests, CRWV buys NVDA chips.  \n   * NVDA *did* pay CRWV for services ($320M deal 2023).Now NVDA says not a customer, and Q1 rev from them <10%. So NVDA invests -> CRWV buys NVDA GPUs -> NVDA *used to* pay CRWV. Circular.  \n* **Applied Digital (APLD):**\n   * CRWV has \\~$7B, 15yr lease deal with APLD for data centers. \n   * CRWV also has warrants for \\~5.5% of APLD. So CRWV is big APLD customer AND investor.  \n\n**So?**\n\nIs CRWV a smart play with AI giants, or a debt bomb waiting to go off if partners, debt, or AI hype fails? They're racing to make cash from contracts to pay debt & upgrade GPUs before tech gets old. \n\nWhat u think? Big win or big fail?\n\n*(NFA, my summary, do ur own DD.)*",
    "score": 1,
    "url": "https://www.reddit.com/r/stocks/comments/1l405js/crwv_ai_rocket_or_debt_bomb_thoughts/",
    "created_utc": 1749132582.0
  },
  {
    "title": "Is NVIDIA Getting Too Hot? My Short-Term Concerns with NVDA ($141.92)",
    "text": "I wrote my thesis on Palantir 30 mins before posting this one and looks like folks are not liking it. Long term NVDA could go up. This is purely a short term play. \n\nThis is going to be a similar take to that one. \n\nNVIDIA’s been on an insane run lately. It was up over 20% since mid May and pushing back to all time highs around $142. The AI hype is obviously still alive and well. I genuinely believe AI is the future but still we need to be a bit more realistic.\n\nHere’s what’s making me cautious:\n\n* Options activity is nuts right now — the $140–$150 calls are getting snapped up like crazy\n* Lots of short-dated call buying, mostly retail\n* The whole “it can’t go down” vibe is creeping back in\n* The stock’s up 10–12% straight with barely any pause\n\nTo be clear, I’m not saying NVDA is a bad company. It’s a beast, and the AI story is real. But even the strongest stocks usually pull back a bit after a move like this.\n\nI’m looking at a possible short if it pushes into the $143–$145 range. Nothing aggressive, just a trade idea. Thinking we could see a pullback to $135ish (which lines up with the last breakout zone).\n\nIf it breaks above $147 though, I’m out. Could easily rip to $150+ from there.\n\nNot trying to fade the long-term trend here. I am just synthesizing unusual market activity, insider moves, options flow, sentiment, technical and news analysis.\n\nDisclaimer: Not Financial Advice.",
    "score": 6,
    "url": "https://www.reddit.com/r/stocks/comments/1l3z97o/is_nvidia_getting_too_hot_my_shortterm_concerns/",
    "created_utc": 1749130257.0
  },
  {
    "title": "Nvidia regains \"most valuable company\" title for the first time since January",
    "text": "Nvidia passed Microsoft in market cap on Tuesday, once again becoming the most valuable publicly traded company in the world.\n\nShares of the artificial intelligence chipmaker rose about 3% on Tuesday to $141.40, and the stock has surged nearly 24% over the past month as Nvidia’s growth has persisted even through export control and tariff concerns.The company now has a $3.45 trillion market cap. Microsoft closed Tuesday with a $3.44 trillion market cap.\n\nNvidia has been trading places with Apple and Microsoft at the top of the market cap ranks since last June. The last time Nvidia was the most-valuable company was on Jan. 24.\n\n[CNBC Article](https://www.cnbc.com/2025/06/03/nvidia-microsoft-most-valuable-company.html)",
    "score": 65,
    "url": "https://www.reddit.com/r/stocks/comments/1l2wfro/nvidia_regains_most_valuable_company_title_for/",
    "created_utc": 1749010762.0
  },
  {
    "title": "You found 4,000$ in your pocket. Where will you put it tomorrow in stocks?",
    "text": "Please help me get the best advice where I can put this? I have 3 ETF DCA in long term Tech, Health and  US stocks.\n\nMy other main stocks and tempting put it and grow my shares is:\n\n•NVIDIA \n•AMD\n\n(Ai stocks and I love gaming)\n\n\nThe growth is not for me, it’s for my future of my family and hopefully back in my country if it’s meant to be. \n\nThank you for your legendary advices!\n\nEdit: Should I DCA this or trust my gut to put it all in on NVDIA? I’m waiting for a downturn of the market but I’m not sure if I should wait?\n\n\nPs: The money is a rollover from my IRA since I stopped working on that first job",
    "score": 0,
    "url": "https://www.reddit.com/r/stocks/comments/1l2vc4h/you_found_4000_in_your_pocket_where_will_you_put/",
    "created_utc": 1749007052.0
  },
  {
    "title": "Nvidia Surges Past Microsoft, US Markets Climb on Strong Economic Data",
    "text": "Just looking at today's market action, the Dow, S&P 500 and Nasdaq are all up nicely, with the Nasdaq leading the way, up about 0.8%. Small caps were also nimble, with the Russell 2000 up about 1.5%.\n\nBut what were the real headlines? NVIDIA's market capitalization soared to $3.444 trillion, officially surpassing Microsoft's $3.441 trillion to become the world's most valuable company. The demand for artificial intelligence chips is clearly exciting investors.\n\nWhat do you think?Does Nvidia's rise signal that the AI boom will drive tech stocks higher? Or is this a peak moment before a pullback? Also, with tariffs still a concern in the OECD report, can these gains hold?",
    "score": 124,
    "url": "https://www.reddit.com/r/stocks/comments/1l2qwzx/nvidia_surges_past_microsoft_us_markets_climb_on/",
    "created_utc": 1748993740.0
  },
  {
    "title": "Thinking about picking up some Google, Apple, Broadcom and NVIDIA stock. Thoughts?",
    "text": "I think all of these companies are heavily undervalued and everyone is scared of tariffs. Google at least won’t be entirely impacted by tariffs and they’re the leader in AI right now. Apple is being thrown around with tariffs but they’re extremely profitable. Nvidia is also undervalued because they’re pretty much the only way to train AI which is the next frontier. Broadcom also has insane revenue growth and momentum. What do yall think? ",
    "score": 30,
    "url": "https://www.reddit.com/r/stocks/comments/1l2qwch/thinking_about_picking_up_some_google_apple/",
    "created_utc": 1748993684.0
  },
  {
    "title": "Lawsues legit ?",
    "text": "I often see alot of stocks like Nvidia being investigated or lawsued for not being transparent and more.\n\nAre these lawsue legit ? Like i had nvidia in a given time period and lost some money on em. Then i signed up on a site with lewi and korsinsky that has this formula i can fill out to see if i can get some money back ?\n\nAm i being fooled or being stupid to believe this is legit ?\n\n  \n",
    "score": 0,
    "url": "https://www.reddit.com/r/stocks/comments/1l2ohuc/lawsues_legit/",
    "created_utc": 1748987381.0
  },
  {
    "title": "Would you Invest in CoreWeave Long Term or place Puts on the Stock?",
    "text": "CoreWeave has been on a tear the last couple months and it's even crazier considering the stock is still really new. Nvidia has a large stake in the company and it could be profitable next year. From that basis, plus the recent news about it and deals with other companies - it could be a great stock to average into for the long term\n\nOn the other hand, most new stocks crash at some point especially when they have a lot of hype. Plus the market in general is really just unpredictable right now with tariffs and the trade war.\n\nWhat I'm asking is both in general what would you recommend doing and what are you doing personally if you own or thought about buying the stock?",
    "score": 20,
    "url": "https://www.reddit.com/r/stocks/comments/1l2dxyq/would_you_invest_in_coreweave_long_term_or_place/",
    "created_utc": 1748962339.0
  },
  {
    "title": "Broadcom Introduces Latest Networking Chip to Accelerate Artificial Intelligence",
    "text": "Broadcom Corp. said on Tuesday that it has begun shipping its latest networking chip designed to accelerate artificial intelligence.\n\nThe chip, called Tomahawk 6, doubles the performance of its predecessor and has other traffic control features that make the networking chip significantly more efficient, Ram Velaga, Broadcom's senior vice president, said in an interview with Reuters on Monday.\n\nThe increase in speed means fewer network switches are needed to perform the same tasks, Viraga said.\n\nBroadcom's networking chips are becoming increasingly important because of artificial intelligence. In building the data centers needed for AI applications, infrastructure builders must string together hundreds or even thousands of chips.\n\nBuilding large-scale clusters of networking chips requires specialized networking devices and chips, of which the Tomahawk family of processors is one.\n\nWith the Tomahawk 6, Broadcom's engineers have increased its speed and functionality to the point where it can be used to build the larger data centers needed for AI, which can daisy-chain more than 100,000 graphics processors (GPUs), Viraga said.\n\nIn a few years, he said, “you'll see a million GPUs housed in one physical building.”\n\nBroadcom's networking chips use the Ethernet networking protocol, which has been a networking standard for decades. NVIDIA makes hardware that uses technology from its competitor InfiniBand, as well as several Ethernet-based products.\n\n“All of these networks can be implemented very simply over Ethernet without the need for esoteric technology,” Velaga said.\n\nThe Tomahawk 6 is the first product in the series to combine multiple chipsets into a single package, a technology known as “chiplets” that has been widely adopted by other chip design companies such as AMD. Velaga said the addition of chiplets roughly doubles the amount of silicon area used in a design. Velaga said the addition of the chiplet roughly doubled the area of silicon used in the design.\n\nBroadcom is using Taiwan Semiconductor Manufacturing Company's three-nanometer process to produce Tomahawk switches.",
    "score": 11,
    "url": "https://www.reddit.com/r/stocks/comments/1l2bvc2/broadcom_introduces_latest_networking_chip_to/",
    "created_utc": 1748957211.0
  },
  {
    "title": "Manufacturing activity contracted in May as imports hit lowest level since 2009",
    "text": "No paywall: [https://finance.yahoo.com/news/nvidia-rival-groq-makes-a-bold-prediction-on-whats-next-for-ai-130743490.html](https://finance.yahoo.com/news/nvidia-rival-groq-makes-a-bold-prediction-on-whats-next-for-ai-130743490.html)\n\nEconomic activity in the US manufacturing sector continued to contract in May as imports tumbled to their lowest level since 2009.\n\nThe Institute for Supply Management's (ISM) manufacturing PMI registered a reading of 48.5 in May, down from April's reading of 48.7. Readings above 50 for this index indicate an expansion in activity, while readings below 50 indicate contraction. The manufacturing sector has been in contraction for most of the past two years.\n\nThe import index sank to a reading of 39.9, well below the 47.1 seen in April. The large decrease in imports came as businesses grapple with President Trump's tariff hikes on various countries. While Trump has recently scaled back some of his initial tariffs, a wide swath of levies are still in place.\n\n“Imports continue to contract as demand has reduced the need to maintain import levels from previous months, as well as due to the impact of tariff pricing,” Susan Spence, chair of the ISM Manufacturing Business Survey Committee, said in a release.\n\nSpence later told Yahoo Finance in an interview that the biggest concern among ISM panelists was tariffs, with 86% of the responses mentioning levies in their comments. Some respondents compared the current operating environment to the struggles seen during the pandemic in 2020.\n\n\"So the only thing that can help is certainty and whatever is going to finally be happening with the individual countries,\" Spence said.\n\nA separate reading on manufacturing activity from S&P Global, also released on Monday, registered a reading of 52, up from a prior reading of 50.2. But S&P Global chief business economist Chris Williamson wrote in the release that the headline data \"masks worrying developments under the hood\" of the US manufacturing sector.\n\n\"While growth of new orders picked up and suppliers were reportedly busier as companies built up their inventory levels at an unprecedented rate, the common theme was a temporary surge in demand as manufacturers and their customers worry about supply issues and rising prices,\" Williamson wrote.",
    "score": 279,
    "url": "https://www.reddit.com/r/stocks/comments/1l1mznc/manufacturing_activity_contracted_in_may_as/",
    "created_utc": 1748882843.0
  }
]