[
  {
    "title": "Tesla stock falls again as Musk's 'KILL the BILL' screed hits Trump tax bill's progress",
    "text": "No paywall: [https://finance.yahoo.com/news/tesla-stock-falls-again-as-musks-kill-the-bill-screed-hits-trump-tax-bills-progress-121409722.html](https://finance.yahoo.com/news/tesla-stock-falls-again-as-musks-kill-the-bill-screed-hits-trump-tax-bills-progress-121409722.html)\n\nTesla (TSLA) stock slumped again on Thursday as the fallout continued to emerge from the very public policy blowout between President Trump and Tesla CEO Elon Musk.\n\n\"Call your Senator, Call your Congressman, Bankrupting America is NOT ok! KILL the BILL,\" Musk posted on X on Wednesday.\n\nMusk added, \"If the massive deficit spending continues, there will only be money for interest payments and nothing else!\"\n\nThe vocal criticism is irking Trump, the Wall Street Journal reported, with a senior official claiming that White House advisors were \"caught off guard\" by Musk's latest broadsides.\n\nTesla stock fell solidly on Wednesday and extended those losses in premarket trading on Thursday, down as much as 3%.\n\nThe comments come after the one-time leader of the Department of Government Efficiency (DOGE) waded earnestly into the debate over the bill this week, angrily posting Tuesday that it was a \"disgusting abomination.\"\n\n\"I'm sorry, but I just can't stand it anymore. This massive, outrageous, pork-filled Congressional spending bill is a disgusting abomination,\" he said.\n\n\"Shame on those\" who voted for it in the House, Musk added.\n\nBloomberg reported that Musk may also be driven by the fact that the federal EV tax credit is being phased out by the bill, as he fought hard to keep it in place as a key driver for Tesla's business.\n\nMusk's barrage comes as the bill faces an uncertain future in the Senate, and a Congressional Budget Office estimation of its impact on the deficit adds fuel to Musk's line of argument.\n\nThe nonpartisan office projected the House-passed version of the bill would add $2.4 trillion to deficits over the next 10 years.\n\nThe formerly Musk-led DOGE itself has been criticized for not producing the budgetary cuts Musk touted it could find, and the cuts it has produced have been deeply unpopular.\n\nMusk's closeness to the Trump administration had been seen as a boon for Tesla, given its business with SpaceX and NASA and the regulatory levers the National Highway Traffic Safety Administration could pull in getting autonomous driving rules in place for Tesla's robotaxi testing.\n\nRead more: How to avoid the sticker shock on Tesla car insurance\n\nBut demand weakness in the EU and recent protests at US Tesla showrooms have followed Musk's controversial foray into politics, causing some Tesla owners to become alienated by Musk, specifically by his right-leaning tendencies, DOGE, and outward support of President Trump.\n\nTesla's big robotaxi test is slated for June 12 in Austin. Much of the company's value is tied to whether it can fully unlock autonomous driving for robotaxi purposes and individual owners.\n\nMeanwhile, Alphabet's (GOOG, GOOGL) Waymo continues to plow ahead and is essentially the leader in the space, accumulating 250,000 robotaxi trips per week.",
    "score": 144,
    "url": "https://www.reddit.com/r/stocks/comments/1l3yldf/tesla_stock_falls_again_as_musks_kill_the_bill/",
    "created_utc": 1749128460.0
  },
  {
    "title": "Tesla: A fatal self-driving crash shows the stupidity of camera-only FSD",
    "text": "https://www.bloomberg.com/features/2025-tesla-full-self-driving-crash/\n\nA Tesla driver using FSD in Phenix Arizona hit a 71 year old grandmother at full speed on the highway when it became confused from the setting sun. Two months after Story's death in Arizona, a Tesla Model 3 with Full Self-Driving engaged crashed in Nipton, California, in January 2024. Another Model 3 crashed two months later in Red Mills, Virginia, followed by another two months later in Collinsville, Ohio. In all four incidents, the collisions occurred in conditions that reduced roadway visibility, such as sun glare, fog or airborne dust.",
    "score": 5388,
    "url": "https://www.reddit.com/r/stocks/comments/1l37wxc/tesla_a_fatal_selfdriving_crash_shows_the/",
    "created_utc": 1749049525.0
  },
  {
    "title": "I’m about to give in and close all my shorts. As soon as I do, I’ll let you know so you can load up on puts.",
    "text": "Okay, I’m almost convinced the market just can’t go down anymore. It’s too strong — it’s only going up. Trump is a genius, and with his unconventional tariff policy, he’ll solve all the problems caused by the future labor surplus due to factory automation (which, by the way, will make Tesla worth $3 trillion). Since I’ve historically been a reverse indicator, i’ll let you know as soon as I close all my shorts so you can load up on puts.",
    "score": 124,
    "url": "https://www.reddit.com/r/stocks/comments/1l30d1m/im_about_to_give_in_and_close_all_my_shorts_as/",
    "created_utc": 1749025982.0
  },
  {
    "title": "What to Expect in the Markets This Week: June 2–6, 2025",
    "text": "No paywall: [https://www.investopedia.com/what-to-expect-in-the-markets-this-week-11744837](https://www.investopedia.com/what-to-expect-in-the-markets-this-week-11744837)\n\n# Key Takeaways\n\n* The May jobs report due Friday comes as the Federal Reserve faces pressure to lower interest rates.\n* Fed Chair Jerome Powell is scheduled to deliver remarks this week, with Philadelphia Fed President Patrick Harker, Dallas Fed President Lorie Logan, and Chicago Fed President Austan Goolsbee also on the calendar.\n* Updated data on the U.S. trade deficit, consumer credit levels, factory orders, and construction spending is also expected.\n* Earnings reports are scheduled from CrowdStrike, Broadcom, Dollar Tree, Five Below, and Lululemon.\n\nUpdated employment data for May, comments from Federal Reserve Chair Jerome Powell, and several noteworthy tech and retail earnings reports highlight this week’s economic calendar.\n\nThe week follows a close to May trading, which was generally upbeat for stocks, featuring strong performances from the S&P 500 and Nasdaq Composite. Recap Investopedia's coverage of last Friday's trading here. The week also brought the latest set of trade ructions, with President Donald Trump on Friday raising fresh questions about the state of affairs with China.\n\nIn addition to a jobs report due Friday, investors also will be watching for reports on job openings and private-sector payrolls. Updated data on the U.S. trade deficit and consumer credit levels will be in focus, as will manufacturing and services industry data, including the Purchasing Managers Index (PMI), construction spending, and factory orders.\n\nIn addition to Powell’s comments on Monday, Fed representatives speaking this week include Philadelphia Fed President Patrick Harker, Dallas Fed President Lorie Logan, and Chicago Fed President Austan Goolsbee.\n\nMarket watchers will be tracking expected earnings reports from Broadcom (AVGO), CrowdStrike Holdings (CRWD), Hewlett Packard Enterprise (HPE), Dollar Tree (DLTR), Dollar General (DG), and Five Below (FIVE).\n\n**Monday, June 2**\n\n* S&P final U.S. manufacturing PMI (May)\n* ISM manufacturing PMI (May)\n* Construction spending (April)\n* Fed speakers: Powell, Logan, Goolsbee\n* Earnings: Campbell’s (CPB), Science Applications International (SAIC)\n\n**Tuesday, June 3**\n\n* Factory orders (April)\n* Job openings (April)\n* Fed speakers: Logan, Goolsbee\n* Earnings:\n   * CrowdStrike Holdings (CRWD)\n   * Ferguson Enterprises (FERG)\n   * Hewlett Packard Enterprise (HPE)\n   * Dollar General (DG)\n   * Guidewire Software (GWRE)\n   * NIO (NIO)\n\n**Wednesday, June 4**\n\n* ADP employment (May)\n* S&P final U.S. services PMI (May)\n* ISM services PMI (May)\n* Federal Reserve Beige Book\n* Fed speaker: Bostic\n* Earnings:\n   * Dollar Tree (DLTR)\n   * Descartes Systems Group (DSGX)\n   * Five Below (FIVE)\n   * PVH Corp (PVH)\n   * Thor Industries (THO)\n\n**Thursday, June 5**\n\n* Initial jobless claims (Week ending May 31)\n* U.S. trade deficit (April)\n* U.S. productivity – first revision (Q1)\n* Fed speaker: Harker\n* Earnings:\n   * Broadcom (AVGO)\n   * Lululemon Athletica (LULU)\n   * Samsara (IOT)\n   * Rubrik (RBRK)\n\n**Friday, June 6**\n\n* U.S. employment report (May)\n* Consumer credit (April)\n\n**Jobs Report Comes As Fed Faces Pressure on Interest Rates**  \nThe scheduled Friday release of the May U.S. jobs report will show whether the labor market continues to exhibit strength after employers added more jobs than analysts expected in April, as the unemployment rate remained at 4.2%.\n\nTrump has been applying pressure on the Fed to cut interest rates from their current levels of 4.25% to 4.5%. Fed officials have said that they are in “wait-and-see” mode as the labor market remains strong and inflation comes under pressure from U.S. tariffs.\n\nEarlier in the week, market watchers will get updates on job openings, private-sector payrolls, and weekly jobless claims.\n\nSeveral Fed officials are scheduled to speak, including Federal Reserve Chair Powell, Dallas Fed President Logan, Chicago Fed President Goolsbee, and Philadelphia Fed President Harker. On Wednesday, the Fed’s Beige Book will provide more details on economic conditions throughout the country.\n\nThe Thursday scheduled report on the U.S. trade deficit comes as tariff threats have pushed shippers to increase imports ahead of the expected import taxes.\n\nInvestors will also be watching manufacturing and services industry surveys scheduled for release this week, as well as updated data on consumer credit levels, factory orders, and construction spending.\n\n**Tech, Retail Earnings Reports in Focus**  \nChipmaker Broadcom’s scheduled financial report, due Thursday, comes on the heels of industry leader Nvidia’s (NVDA) report last week that showed continued demand for artificial intelligence (AI) products. Broadcom reported a 77% jump in its AI-related revenue in its most recent financial release as company executives forecast continued growth in that sector.\n\nCybersecurity company CrowdStrike Holdings is expected to release its earnings on Tuesday. The firm said in early May that it planned to cut 5% of its workforce. Guidewire Software, which provides services to insurance providers, is also expected to deliver an update on its AI products Tuesday.\n\nLogistics software provider Descartes Systems Group is expected to release its earnings on Wednesday. Shippers continue to grapple with the impact of Trump's tariffs on the supply chain.\n\nWith consumer sentiment surveys showing increasing concerns over economic conditions, investors will be watching reports from retailers for signals on spending. Scheduled reports from Dollar General on Tuesday and Dollar Tree and Five Below on Wednesday will provide a look at consumer traffic at those stores. Campbell’s scheduled report on Monday will shine a light on food spending, while fashion brands Lululemon and Calvin Klein parent PVH also will be reporting.\n\nOther noteworthy reports this week include Chinese electric vehicle maker NIO, a competitor to Tesla in that country, and information technology provider Hewlett Packard Enterprise.",
    "score": 57,
    "url": "https://www.reddit.com/r/stocks/comments/1l0ouqw/what_to_expect_in_the_markets_this_week_june_26/",
    "created_utc": 1748784159.0
  },
  {
    "title": "The Sum of All Fears: Debt Crisis, Stagflation, High Rates, Tight Liquidity, Political Division, and Tech Valuation Pressures",
    "text": "Are you still optimistic? How much can the US stock market rise? In another 18 days, Tesla will reach $500. Will Nvidia break $300 in the third quarter?\n\nI often hear such questions, but whenever I discuss confirmed economic issues with them, I am always laughed at.\n\nWill the US economy always rise? If the time scale is extended, then it must be, because if we look at the US economy in units of 5 years, at most there is a plateau period in a short time axis, and then it rises.\n\nBut when we expand the time axis, we will see the peaks and troughs brought by the economic cycle.\n\nIn 2000, my Hong Kong boss said to me who had just joined the company, \"Now is the IT crisis, but it is also an opportunity. Don't worry, the economy is always like this, good four years, bad four years, very good four years, very bad four years\". When it is good, work hard to make money, when it is bad, enjoy life, study for a doctorate or have a child, or travel.\n\nHow many years has the United States not had an economic crisis? I think it has been 12 years since the subprime mortgage crisis in 2008. The economy was bad for half a year during the pandemic, and then there was a crazy rebound. Everyone was shouting, great, great, great.\n\nBut is this normal? I think all investment bank researchers, except Goldman Sachs, are terrified. Including Powell, as the title says, there are liquidity problems, US debt problems, Japanese carry trade problems, uncertain political environment, and overpriced US stocks.\n\nMany people on Twitter Space are asking \"Why haven't you cut interest rates yet? What are you waiting for?\" When I started talking to them about the whole environment using macroeconomics and monetary principles. Most people said \"Are you a nerd?\" \"Why are you telling us these words from books? Don't you see that nothing exists?\"\n\nAnd real traders sent me private messages saying \"Don't make trouble, no one will believe you, pessimists are always right, optimists make money, you won't prevent us from making money, but you will make us feel sick.\"\n\nThis is the problem happening now.\n\nOr just like the post in the morning, imagine that if Tesla is found to not exist in the future and starts to trample, how much will the stock price be considered normal.\n\nRational researchers have already calculated it. $60-80 per share is reasonable. This still requires that Tesla's automotive business cannot slow down, and that businesses other than automotive must continue to expand within three years, such as points, Bitcoin, energy storage, and Robotaxi.\n\nIf this premise does not exist, it will be even more devastating.\n\nIf Tesla is trampled and the US stock market falls, it will cause panic flight of global assets, and a larger area of ​​trampling will occur. If the Bank of Japan raises interest rates again, carry trades will withdraw money, which is the\n\n\"sum of fear\"\n\nWhy is there a liquidity crisis for the US dollar, and why Powell dares not cut interest rates casually when the US GDP continues to improve and the unemployment rate falls.\n\nThis is another problem facing the United States now. If interest rates are cut and money is withdrawn, the liquidity crisis will come early. The market is facing collapse. If interest rates are not raised, the whole world will eat high interest rates in the United States and be comfortable, and the money is also in the United States.\n\nBut does the United States just need to maintain high interest rates? It depends on whether the final BIG American BILL can be passed.\n\nAfter all, in Chinese terms, \"internal debt is not debt\" The Chinese government firmly believes in this truth, and they are crazy about printing money and issuing money to stimulate the economy. Because internal debt is not debt at all.\n\nIt’s just that Chinese economists only said the first half of the sentence, and they always forgot to say the second half for various reasons\n\n“Domestic debt is not a debt, as long as people are still there”\n\n\n\nThe above content is derived by me based on macroeconomics. Macroeconomics usually has a huge time deviation from reporting to the occurrence of actual problems. For example, the forecast is next week, but it may be delayed by 10 years.\n\n\n\n# John Maynard Keyns \"In the long run, we are all dead\"",
    "score": 0,
    "url": "https://www.reddit.com/r/stocks/comments/1l0gjhl/the_sum_of_all_fears_debt_crisis_stagflation_high/",
    "created_utc": 1748753064.0
  },
  {
    "title": "Your top 5 picks and why?",
    "text": "Please post your top 5 stocks that you feel are undervalued. \n\n1. Rivian (my target price is $11-$12. Tesla has a lot of haters right now and I see a ton of Rivians on the road. They need to fix their charging infrastructure, but overall a solid car plus they got invested in my Volkswagen so they have plenty of cash to burn. \n\n2. Target - maybe not the Best Buy with the tariff situation but still undervalued imo. \n\n3. Nio - stock with lots of potential and extreme down fall. I'm not super confident in this one but $3 price and a growing EV market in China seems interesting. Would not sit in this one too long. Careful this Monday is earnings date. \n\n4. SNAP - I don't believe in the app but they got a lot of money and one interesting development or positive stock news means it will hit $10-15. This stock has been know to go up and down from $6-$15. Would sell at 20-30 percent increase.\n\n5.AMD - still undervalued, long on this one. ",
    "score": 76,
    "url": "https://www.reddit.com/r/stocks/comments/1l0fddy/your_top_5_picks_and_why/",
    "created_utc": 1748749024.0
  },
  {
    "title": "Tesla: The Enron-Lehman Hybrid of Our Time — When AI Dreams, Meme Stocks, and Narrative Capitalism Finally Hit the Wall",
    "text": "Statement. This is a post that rationally discusses the prospects of Tesla and the huge bubble in the US stock market. I know that my native language is Chinese. Many posts before this have been criticized for their poor English, so I used GPT to translate it into English, but the content is all written by me. I hope the administrator will not delete it.\n\n  \n*Thank you very much for pointing out the error in the article. The market value today is 1.09 trillion, which is about double the sum of the eight auto companies. If this is not a bubble, then what is a bubble?*\n\n**Once upon a bull market, Tesla wasn't just a car company. It was a religion. A meme. A movement. A narrative so powerful it defied gravity, valuation models, and even quarterly earnings. But now? It looks more like a slow-motion collapse wrapped in AI promises and tweet-sized miracles.**\n\nTesla's market cap—still hovering near **$1.09 trillion**—dwarfs the combined value of multiple legacy automakers that, together, sell tens of millions more vehicles annually. Toyota, Volkswagen, BMW, Stellantis, GM, Ford, Honda, Hyundai... all still trail behind. Tesla, meanwhile, **sells fewer cars**, has **no new models in sight**, and faces a **50% drop in European sales**.\n\nWhat’s driving that valuation? Not cars. Not earnings. Not delivery growth. Just **narratives**.\n\n**Narrative #1: FSD will change the world.**  \nIt hasn’t. Tesla’s Full Self-Driving remains a **Level 2 driver assist system**—miles away from full autonomy. Elon’s promises of robotaxis “next year” date back to 2016. Today, regulatory hurdles and technical stagnation have turned this dream into a meme.\n\n**Narrative #2: Tesla is an AI company.**  \nSure—if you consider YouTube clips of “optimus” robots doing carefully choreographed tasks a viable roadmap. The humanoid robot narrative is pure sci-fi, built for headlines and hopium.\n\n**Narrative #3: Clean energy saviour.**  \nTesla earns billions not from products, but from **regulatory carbon credits**—money that vanishes as competitors go electric. Even subsidies are drying up in markets like Germany and the U.S.\n\nSo what’s left? **Bitcoin gains.** Elon’s real alpha play may just be Doge-fueled attention arbitrage.\n\n**But here’s the real danger:**  \nTesla isn’t just a company—it’s become **too big to ignore**, and perhaps **too public to fail quietly**. Global pension funds, ESG portfolios, sovereign wealth managers, and speculative capital fueled by zero-interest rates are all in deep. Behind every retail trader shouting “diamond hands” is a sleepy institutional allocator praying this doesn’t blow up before retirement.\n\nIf Tesla collapses, it won’t be Enron—a cooked-book scandal.  \nIt won’t be Lehman—a financial black hole.  \nIt will be **both**:\n\n* The faith-based valuation of Enron\n* The systemic exposure of Lehman\n\nA bursting Tesla bubble could trigger **liquidity shocks**, **portfolio meltdowns**, and a **narrative crash** that destroys trust in market rationality.\n\n**Narrative capitalism brought us here.**  \nA reality show CEO. A meme-powered valuation. A fanbase more loyal than customers. We’ve built a castle of perception with no foundation of delivery.\n\nAnd when castles fall, they don’t just crumble.  \nThey **implode—loudly**.",
    "score": 199,
    "url": "https://www.reddit.com/r/stocks/comments/1kzsw8o/tesla_the_enronlehman_hybrid_of_our_time_when_ai/",
    "created_utc": 1748683128.0
  },
  {
    "title": "Given the prices of Chinese EVs, what is the future of European and American automakers?",
    "text": "BYD Seagul, a small city car, starts at around 7'500 USD. BYD Seal, a competent alternative to Tesla Model 3, is around 12k.\n\nThese are prices in China, but soon enough, these prices will come to South East Asia, South America, Australia and elsewhere.\n\nGiven the prices of Chinese EVs, what is the future of automotive industry in the EU, US, JP and KR? ",
    "score": 128,
    "url": "https://www.reddit.com/r/stocks/comments/1kzjgkm/given_the_prices_of_chinese_evs_what_is_the/",
    "created_utc": 1748649687.0
  },
  {
    "title": "Tesla stock poised for another weekly gain as Musk prepares to make full return to company amid alleged drug abuse",
    "text": "[https://finance.yahoo.com/news/tesla-stock-poised-for-another-weekly-gain-as-musk-prepares-to-make-full-return-to-company-amid-alleged-drug-abuse-145236528.html?guccounter=1](https://finance.yahoo.com/news/tesla-stock-poised-for-another-weekly-gain-as-musk-prepares-to-make-full-return-to-company-amid-alleged-drug-abuse-145236528.html?guccounter=1)\n\n>Musk is slated to hold a press conference with President Trump from the White House at 1:30 p.m. ET, marking his last day as a special government employee.\n\n>This comes after the [New York Times](https://www.nytimes.com/2025/05/30/us/elon-musk-drugs-children-trump.html) reported Friday morning that Musk allegedly abused both illicit and pharmaceutical drugs \"far more intensely than previously known\" while on the campaign trail for Trump.\n\n>Musk reportedly had a medication box that held about 20 pills, and was taking so much ketamine — a drug with hallucinogenic and dissociative effects — that it was affecting his bladder. Musk also reportedly took ecstasy, psychedelic mushrooms, and Adderall on occasion, sources told the New York Times.",
    "score": 466,
    "url": "https://www.reddit.com/r/stocks/comments/1kz722k/tesla_stock_poised_for_another_weekly_gain_as/",
    "created_utc": 1748618740.0
  },
  {
    "title": "Elon Musk Leaves DC to Refocus on Tesla and SpaceX   Bullish for TSLA?",
    "text": "Elon Musk just stepped down from his controversial advisory role in the Trump administration, where he led aggressive cuts under the so-called Department of Government Efficiency\n\nNow he says he’s shifting back to focus on Tesla and SpaceX. With all the concern over Musk being distracted by politics, could this be a turning point for TSLA?\n\nIs this a bullish signal, or has the political drama already done some damage to investor sentiment? Curious what the rest of you think",
    "score": 0,
    "url": "https://www.reddit.com/r/stocks/comments/1kyplgw/elon_musk_leaves_dc_to_refocus_on_tesla_and/",
    "created_utc": 1748561675.0
  }
]