[
  {
    "title": "Is NVIDIA Getting Too Hot? My Short-Term Concerns with NVDA ($141.92)",
    "text": "I wrote my thesis on Palantir 30 mins before posting this one and looks like folks are not liking it. Long term NVDA could go up. This is purely a short term play. \n\nThis is going to be a similar take to that one. \n\nNVIDIA’s been on an insane run lately. It was up over 20% since mid May and pushing back to all time highs around $142. The AI hype is obviously still alive and well. I genuinely believe AI is the future but still we need to be a bit more realistic.\n\nHere’s what’s making me cautious:\n\n* Options activity is nuts right now — the $140–$150 calls are getting snapped up like crazy\n* Lots of short-dated call buying, mostly retail\n* The whole “it can’t go down” vibe is creeping back in\n* The stock’s up 10–12% straight with barely any pause\n\nTo be clear, I’m not saying NVDA is a bad company. It’s a beast, and the AI story is real. But even the strongest stocks usually pull back a bit after a move like this.\n\nI’m looking at a possible short if it pushes into the $143–$145 range. Nothing aggressive, just a trade idea. Thinking we could see a pullback to $135ish (which lines up with the last breakout zone).\n\nIf it breaks above $147 though, I’m out. Could easily rip to $150+ from there.\n\nNot trying to fade the long-term trend here. I am just synthesizing unusual market activity, insider moves, options flow, sentiment, technical and news analysis.\n\nDisclaimer: Not Financial Advice.",
    "score": 19,
    "url": "https://www.reddit.com/r/stocks/comments/1l3z97o/is_nvidia_getting_too_hot_my_shortterm_concerns/",
    "created_utc": 1749130257.0
  },
  {
    "title": "Nvidia regains \"most valuable company\" title for the first time since January",
    "text": "Nvidia passed Microsoft in market cap on Tuesday, once again becoming the most valuable publicly traded company in the world.\n\nShares of the artificial intelligence chipmaker rose about 3% on Tuesday to $141.40, and the stock has surged nearly 24% over the past month as Nvidia’s growth has persisted even through export control and tariff concerns.The company now has a $3.45 trillion market cap. Microsoft closed Tuesday with a $3.44 trillion market cap.\n\nNvidia has been trading places with Apple and Microsoft at the top of the market cap ranks since last June. The last time Nvidia was the most-valuable company was on Jan. 24.\n\n[CNBC Article](https://www.cnbc.com/2025/06/03/nvidia-microsoft-most-valuable-company.html)",
    "score": 71,
    "url": "https://www.reddit.com/r/stocks/comments/1l2wfro/nvidia_regains_most_valuable_company_title_for/",
    "created_utc": 1749010762.0
  },
  {
    "title": "Nvidia Surges Past Microsoft, US Markets Climb on Strong Economic Data",
    "text": "Just looking at today's market action, the Dow, S&P 500 and Nasdaq are all up nicely, with the Nasdaq leading the way, up about 0.8%. Small caps were also nimble, with the Russell 2000 up about 1.5%.\n\nBut what were the real headlines? NVIDIA's market capitalization soared to $3.444 trillion, officially surpassing Microsoft's $3.441 trillion to become the world's most valuable company. The demand for artificial intelligence chips is clearly exciting investors.\n\nWhat do you think?Does Nvidia's rise signal that the AI boom will drive tech stocks higher? Or is this a peak moment before a pullback? Also, with tariffs still a concern in the OECD report, can these gains hold?",
    "score": 126,
    "url": "https://www.reddit.com/r/stocks/comments/1l2qwzx/nvidia_surges_past_microsoft_us_markets_climb_on/",
    "created_utc": 1748993740.0
  },
  {
    "title": "Thinking about picking up some Google, Apple, Broadcom and NVIDIA stock. Thoughts?",
    "text": "I think all of these companies are heavily undervalued and everyone is scared of tariffs. Google at least won’t be entirely impacted by tariffs and they’re the leader in AI right now. Apple is being thrown around with tariffs but they’re extremely profitable. Nvidia is also undervalued because they’re pretty much the only way to train AI which is the next frontier. Broadcom also has insane revenue growth and momentum. What do yall think? ",
    "score": 33,
    "url": "https://www.reddit.com/r/stocks/comments/1l2qwch/thinking_about_picking_up_some_google_apple/",
    "created_utc": 1748993684.0
  },
  {
    "title": "Dow Jones, S&P 500 and Nasdaq rise as Wall Street weighs Trump tariff ban and NVIDIA earnings",
    "text": "U.S. stocks rose Thursday as the market assessed NVIDIA's ( NVDA ) earnings report and a U.S. trade court ruling that blocked President Trump's imposition of global tariffs.\n\nThe Standard & Poor's 500 Index (\\^GSPC) rose about 0.9%. The Dow Jones Industrial Average (\\^DJI) was up about 0.3% and the Nasdaq Composite (\\^IXIC) was up 1.4%.\n\nShares of NVIDIA rose more than 5% after first-quarter revenue beat estimates . Investors appeared to ignore a warning from the artificial intelligence chip maker, which expects to lose $8 billion in second-quarter sales due to U.S. export restrictions to China.\n\nOverall, Nvidia's performance on Wednesday bolstered Wall Street's hopes that big tech companies can weather Trump's far-reaching trade policies.",
    "score": 37,
    "url": "https://www.reddit.com/r/stocks/comments/1kybe8h/dow_jones_sp_500_and_nasdaq_rise_as_wall_street/",
    "created_utc": 1748526866.0
  },
  {
    "title": "NVIDIA Earnings Tomorrow – The Market’s Locomotive Report. Thoughts?",
    "text": "NVIDIA is reporting earnings tomorrow, and honestly, it feels like the entire market is holding its breath. Whether you're in tech, semis, or just broad index funds, NVIDIA has become the locomotive pulling this market forward.\n\nInvestor sentiment, momentum,... — all could shift depending on how NVDA performs.\n\nPersonally, I am expecting a really strong report. Demand for AI infrastructure is still booming, The AI Economy is booming, and NVIDIA has been at the center of it.\n\nWhat are your expectations? Bullish, cautious, or sitting on the sidelines?",
    "score": 43,
    "url": "https://www.reddit.com/r/stocks/comments/1kwpvcb/nvidia_earnings_tomorrow_the_markets_locomotive/",
    "created_utc": 1748358974.0
  },
  {
    "title": "Nvidia earnings Trump tariff updates, and the Fed's preferred inflation gauge: What to know this week",
    "text": "Stocks' feverish rebound over the past month is now on pause as growing concerns about the fiscal deficit have sent Treasury yields roaring higher and President Trump is once again threatening to escalate tariffs.\n\n\n\nOn Friday, Trump threatened to place a direct 25% tariff on Apple products not made in the US while also warning he'd ramp up duties on the European Union to 50% at the start of June. This solidified a week of decline for stocks as the Nasdaq Composite (\\^IXIC) and Dow Jones Industrial Average (\\^DJI) dropped about 2.4%. Meanwhile, the S&P 500 (\\^GSPC) slid roughly 2.6% on the week.\n\n\n\nIn the week ahead, updates on the trade war and Trump's pending tax bill will remain in focus, while quarterly results from Nvidia (NVDA) are expected to take center stage on Wednesday after the market close. Reports from Okta (OKTA), Salesforce (CRM), and Costco (COST) will also receive investor attention.\n\n\n\nThe release of the Federal Reserve's preferred inflation gauge on Friday will headline the economic data schedule. Markets will be closed on Monday for Memorial Day.\n\n\n\nTariff escalation\n\nPresident Trump's policies have continued to drive markets. Concerns over Trump's tax bill boosting the government deficit have pushed Treasury yields higher. At over 5.1%, the 30-year Treasury yield (\\^TYX) had been hovering near its highest level since 2007, while the 10-year Treasury yield (\\^TNX) had pressed above 4.6%, its highest level since February.\n\n\n\nBut the sell-off in bonds eased on Friday as Trump once again threatened to escalate tariffs, sending a reminder to investors that even with a 90-day tariff pause on a wide swath of countries, the trade policy whipsaw in markets is far from over.\n\n\n\n\"Safe to say for the time being we’ve hit 'trough' trade uncertainty,\" Piper Sandler chief investment strategist Michael Kantrowitz wrote in a note to clients on Friday. \"At this point markets need to see these tariffs retracted AND bond yields to not spike again for any material move higher.\"\n\n\n\nFriday's decline in treasuries sent the 10-year below the key 4.5% level Kantrowitz has been watching. As Kantrowitz highlights in the chart below, once the 10-year Treasury yield has risen above 4.5%, interest rate-sensitive stocks have seen increased underperformance in recent years.\n\n\n\nThis played out in last week's market action with the Russell 2000 Index (\\^RUT), which has many companies with more interest rate exposure than the S&P 500, falling nearly 4% compared to the S&P 500's 2.6% decline.\n\n\n\nThe AI leader reports\n\nNvidia is set to report quarterly results on Wednesday after the market close. Investors will be closely watching for any updates on demand from the leading supplier of AI chips. For the quarter, Nvidia is expected to report adjusted earnings per share (EPS) of $0.88 on revenue of $43.3 billion, according to Bloomberg analyst consensus data. The company reported adjusted EPS of $0.61 on revenue of $26 billion in the same period last year.\n\n\n\nGiven Nvidia's position as one of the top holdings in the S&P 500, investors will also be watching how the report affects other tech stocks and the broader market. Shares of Nvidia are roughly flat this year after whipsawing amid growing fears of AI competition and tariff concerns.\n\n\n\nSince the launch of ChatGPT in November 2022, Nvidia alone has accounted for about 17% of the S&P 500's gains.\n\n\n\nPrice check\n\nTariffs have increased fears that inflation could spike again. But there's been little evidence of a resurgence thus far in economic data, and economists expect a similar story to play out in the coming week.\n\n\n\nA fresh look at a key inflation measure will come on Friday with the April PCE release. Economists project annual \"core\" PCE — which excludes the volatile categories of food and energy — to have clocked in at 2.5% in April, down from the 2.6% seen in March. Over the prior month, economists project \"core\" PCE at 0.1%, above the 0% seen the month prior.",
    "score": 95,
    "url": "https://www.reddit.com/r/stocks/comments/1kv4ikx/nvidia_earnings_trump_tariff_updates_and_the_feds/",
    "created_utc": 1748185011.0
  },
  {
    "title": "Nvda (Nvidia) upcoming earnings will either pump or dump the market",
    "text": "The last few nvidia earnings have been okay, and its been trading sideways for the most part. \n\nThis upcoming earnings will be very different. I imagine nvidia earnings will be great, but outlook is the main problem, stock market is very future oriented. Trump has blocked more of nvidia sales to china, but also brokered more deals in the middle east. Tariffs also increasing prices etc. \n\nMy question is what do you think nvidia will report on their future outlook, positive, negative or both? \n\nCurrently ai is whats making the market go up, and nvidia is the current leader. If outlook is slightly negative, I believe the market will dump, if its really negative market is going to bleed badly. \n\nCurrently have 1 month out calls on Nvda, Smci, Mrvl. Will hedge with qqq puts closer to nvidia earnings. I believe nvda will have both positive/negative outlook news, but positive news greatly outweighing the negatives. ",
    "score": 101,
    "url": "https://www.reddit.com/r/stocks/comments/1kuq2nn/nvda_nvidia_upcoming_earnings_will_either_pump_or/",
    "created_utc": 1748133402.0
  },
  {
    "title": "Nvidia to launch cheaper Blackwell AI chip for China after US export curbs, sources say",
    "text": "No paywall: [https://finance.yahoo.com/news/exclusive-nvidia-launch-cheaper-blackwell-120346162.html](https://finance.yahoo.com/news/exclusive-nvidia-launch-cheaper-blackwell-120346162.html)\n\nPaywall: [https://www.reuters.com/world/china/nvidia-launch-cheaper-blackwell-ai-chip-china-after-us-export-curbs-sources-say-2025-05-24/](https://www.reuters.com/world/china/nvidia-launch-cheaper-blackwell-ai-chip-china-after-us-export-curbs-sources-say-2025-05-24/)\n\nBEIJING/TAIPEI (Reuters) -Nvidia will launch a new artificial intelligence chipset for China at a significantly lower price than its recently restricted H20 model and plans to start mass production as early as June, sources familiar with the matter said.\n\nThe GPU or graphics processing unit will be part of Nvidia's latest generation Blackwell-architecture AI processors and is expected to be priced between $6,500 and $8,000, well below the $10,000-$12,000 the H20 sold for, according to two of the sources.\n\nThe lower price reflects its weaker specifications and simpler manufacturing requirements.\n\nIt will be based on Nvidia's RTX Pro 6000D, a server-class graphics processor and will use conventional GDDR7 memory instead of more advanced high bandwidth memory, the two sources said.\n\nThey added it would not use Taiwan Semiconductor Manufacturing Co's advanced Chip-on-Wafer-on-Substrate (CoWoS) packaging technology.\n\nThe new chip's price, specifications and production timing have not previously been reported.\n\nThe three sources Reuters spoke to for this article declined to be identified as they were not authorized to speak to media.\n\nAn Nvidia spokesperson said the company was still evaluating its \"limited\" options. \"Until we settle on a new product design and receive approval from the U.S. government, we are effectively foreclosed from China's $50 billion data center market.\"\n\nTSMC declined to comment.\n\nChina remains a huge market for Nvidia, accounting for 13% of its sales in the past financial year. It's the third time that Nvidia has had to tailor a GPU for the world's second-largest economy after restrictions from U.S. authorities who are keen to stymie Chinese technological development.\n\nAfter the U.S. effectively banned the H20 in April, Nvidia initially considered developing a downgraded version of the H20 for China, sources have said, but that plan didn't work out.\n\nNvidia CEO Jensen Huang said last week the company's older Hopper architecture - which the H20 uses - can no longer accommodate further modifications under current U.S. export restrictions.\n\nReuters was unable to determine the product's final name.\n\nChinese brokerage GF Securities said in a note published on Tuesday that the new GPU would likely be called the 6000D or the B40, though it did not disclose pricing or cite sources for the information.\n\nAccording to two of the sources, Nvidia is also developing another Blackwell-architecture chip for China that is set to begin production as early as September. Reuters was not immediately able to confirm specifications of that variant.\n\nNvidia's market share in China has plummeted from 95% before 2022, when U.S. export curbs that impacted its products began, to 50% currently, Huang told reporters in Taipei this week. Its main competitor is Huawei which produces the Ascend 910B chip.\n\nHuang also warned that if U.S. export curbs continue, more Chinese customers will buy Huawei's chips.\n\nThe H20 ban forced Nvidia to write off $5.5 billion in inventory and Huang told the Stratechery podcast on Monday that the company also had to walk away from $15 billion in sales.\n\nThe latest export restrictions introduced new limits on GPU memory bandwidth - a crucial metric measuring data transmission speeds between the main processor and memory chips. This capability is particularly important for AI workloads that require extensive data processing.\n\nInvestment bank Jefferies estimates that the new regulations cap memory bandwidth at 1.7-1.8 terabytes per second. That compares with the 4 terabytes per second that the H20 is capable of.\n\nGF Securities forecast the new GPU will achieve approximately 1.7 terabytes per second using GDDR7 memory technology, just within the export control limits.\n\n",
    "score": 123,
    "url": "https://www.reddit.com/r/stocks/comments/1kudzvt/nvidia_to_launch_cheaper_blackwell_ai_chip_for/",
    "created_utc": 1748099833.0
  },
  {
    "title": "Oracle to buy $40bn of Nvidia chips for OpenAI’s new US data centre",
    "text": "No paywall: [https://finance.yahoo.com/news/oracle-buy-40-billion-nvidia-181443286.html](https://finance.yahoo.com/news/oracle-buy-40-billion-nvidia-181443286.html)\n\nPaywall: [https://www.ft.com/content/a9cd130f-f6bf-4750-98cc-19d87394e657](https://www.ft.com/content/a9cd130f-f6bf-4750-98cc-19d87394e657)\n\nOracle will spend around $40bn on Nvidia’s high-performance computer chips to power OpenAI’s new giant US data centre, as tech groups race to build the vast infrastructure needed to underpin artificial intelligence models.\n\nThe site in Abilene, Texas, has been billed as the first US Stargate project, the $500bn data centre scheme spearheaded by OpenAI and SoftBank, and will provide 1.2 gigawatts of power when it is completed next year, making it one of the largest in the world.\n\nOracle will purchase around 400,000 of Nvidia’s GB200 chips — its latest “superchip” for training and running AI systems — and lease the computing power to OpenAI, according to several people familiar with the matter.\n\nThe site’s owners, Crusoe and US investment firm Blue Owl Capital, have raised $15bn in debt and equity to finance the Abilene project, which will encompass eight buildings and first broke ground in June last year.\n\nThe data centre is expected to be fully operational by mid-2026. Oracle has agreed to lease the site for 15 years. Stargate, which incorporated earlier this year, has not invested in the site.\n\nJPMorgan has provided the bulk of the debt financing across two loans totalling $9.6bn, according to people close to the matter, including a $7.1bn loan announced this week. Crusoe and Blue Owl have separately invested around $5bn in cash.\n\nOnce completed, its scale will rival plans by Elon Musk to expand his “Colossus” data centre in Memphis, Tennessee, to house around 1mn Nvidia chips. Much of the data centre has so far been built on Nvidia’s earlier H100 and H200 chips, which are less powerful. Musk said this week that the next phase of Colossus would be the “first Gigawatt AI training supercluster”. Amazon is building a data centre in northern Virginia that will be larger than 1GW.\n\nThe Abilene data centre is a crucial step in OpenAI’s move to reduce its dependence on Microsoft. Previously, the $300bn-start up has exclusively relied on the US software giant for its computing power, and a large chunk of Microsoft’s near-$14bn investment in OpenAI has come in the form of cloud computing credits.\n\nOpenAI and Microsoft agreed to terminate their exclusivity agreement earlier this year after the start-up became frustrated that its demand for power far exceeded the US tech giant’s supply. The two groups are negotiating to determine how long Microsoft will retain licensing rights to OpenAI’s models.\n\nStargate will play a key role in providing OpenAI’s future computing power. The high-profile venture, billed as a huge infrastructure project to boost the US AI industry, is raising $100bn to spend on data centre projects, with the figure rising to as much as $500bn over the next four years.\n\nOpenAI and SoftBank have each committed $18bn to Stargate, which was unveiled in January by US President Donald Trump. Oracle and MGX, an Abu Dhabi sovereign wealth fund, committed a further $7bn each, according to a person familiar with the matter.\n\nThe four groups will hold equity stakes in the project, with SoftBank and OpenAI the majority owners, according to a second person with knowledge of the matter. Stargate has not committed capital to any data centre project so far.\n\nOpenAI has also expanded its Stargate project overseas, with plans to build a massive data centre in the UAE that was announced as part of Trump’s Gulf tour last week. The 10 sq mile UAE-US AI campus, located in Abu Dhabi and built by Emirati AI company G42, is planned to have 5GW of data centre power — equivalent to more than 2mn of AI chipmaker Nvidia’s latest generation of GB200 chips.\n\nOracle did not immediately respond to a request for comment. JPMorgan and OpenAI declined to comment.",
    "score": 333,
    "url": "https://www.reddit.com/r/stocks/comments/1ktqju3/oracle_to_buy_40bn_of_nvidia_chips_for_openais/",
    "created_utc": 1748024146.0
  }
]